InformationRegisters/ЗначенияНастроекПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияНастроекПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НастройкиПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияНастроекПользователей/Ext/ManagerModule.bsl
Функция ПолучитьЗначениеНастройки(Настройка, Пользователь = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗначенияНастроекПользователей.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ЗначенияНастроекПользователей КАК ЗначенияНастроекПользователей
		|ГДЕ
		|	ЗначенияНастроекПользователей.Пользователь = &Пользователь
		|	И ЗначенияНастроекПользователей.Настройка = &Настройка");
		
	Запрос.УстановитьПараметр("Настройка",		Настройка);
	Запрос.УстановитьПараметр("Пользователь",	?(Пользователь = Неопределено, РаботаСПользователями.ТекущийПользователь(), Пользователь));
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	
	Возврат ?(ВыборкаЗапроса.Следующий(), ВыборкаЗапроса.Значение, Неопределено);
	
КонецФункции
